Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: However, as C<$!> is the value of C's C<errno>, which can be set by any system call, this means that the value of the exit code used by C<die> can be non-predictable, so should not be relied upon, other than to be non-zero.
es_es: Sin embargo, como C<$!> es el valor de C de C<errno>, que se puede establecer por cualquier llamada al sistema, esto significa que el valor del código de salida utilizada por C<die> puede ser no-previsible, por lo que no debe confiarse en él, aparte de ser distinto de cero.

source: If you are upgrading from an earlier release such as 5.6.1, first read the L<perl58delta>, which describes differences between 5.6.0 and 5.8.0, and the L<perl581delta> and L<perl582delta>, which describe differences between 5.8.0, 5.8.1 and 5.8.2
es_es: Si está actualizando desde una versión anterior como la 5.6.1, primero lea L<perl58delta>, que describe las diferencias entre 5.6.0 y 5.8.0, y L<perl581delta> y L<perl582delta>, que describe las diferencias entre 5.8.0, 5.8.1 y 5.8.2.

source: printf '<%#b>', 12; # prints "<0b1100>"
es_es: printf '<%#b>', 12; # imprime "<0b1100>"

source: Similarly, "extra" nybbles are ignored during unpacking.
es_es: Del mismo modo, los nibles "extra" son ignorados durante el desempaquetado.

source: Function and method names seem to work best as all lowercase.
es_es: Funciones y nombres de métodos parece que funcionan mejor con minúsculas.

source: lt less than
es_es: lt menor que

source: Note that write is I<not> the opposite of C<read>.
es_es: Tenga en cuenta que write I<no> es lo contrario de C<read>.

source: It is available starting from perl 5.10.0.
es_es: Está disponible a partir de perl 5.10.0.

source: Note that you cannot read from the DATA filehandle in a BEGIN block: the BEGIN block is executed as soon as it is seen (during compilation), at which point the corresponding __DATA__ (or __END__) token has not yet been seen.
es_es: Tenga en cuenta que no puede leer desde el identificador de archivo de datos en un bloque BEGIN: el bloque BEGIN se ejecutará tan pronto como sea visto (durante la compilación), momento en que el correspondiente símbolo __DATA__ (o __END__) aún no se ha visto.

source: %map = ('red',0x00f,'blue',0x0f0,'green',0xf00);
es_es: %map = ('rojo',0x00f,'azul',0x0f0,'verde',0xf00);

source: Use of a subroutine call, rather than a subroutine name, as an argument to exists() is an error.
es_es: Usar una llamada de subrutina en lugar del nombre de una subrutina como argumento a exists() es un error.

source: =head1 BUILDING PERL ON DG/UX
es_es: =head1 COMPILANDO PERL EN DG/UX

source: See L<perlvar/$^F>.
es_es: Ver L<perlvar/$^F>.

source: If the FILEHANDLE is an EXPR, then the expression is evaluated and the resulting string is used to look up the name of the FILEHANDLE at run time.
es_es: Si el IDENTIFICADOR_ARCHIVO es una EXPR, entonces la expresión se evalúa y la cadena resultante se utiliza para buscar el nombre del IDENTIFICADOR_ARCHIVO en tiempo de ejecución.

source: See L<Carp> for details of C<croak()>, C<carp()> and other useful routines.)
es_es: Vea L<Carp> para más detalles sobre C<croak()>, C<carp()> y otras rutinas útiles.)

source: Unlike in any of the shells, single quotes do not hide variable names in the command from interpretation.
es_es: A diferencia de cualquiera de los shell, las comillas simples no impiden que los nombres de variables sean interpretadas, en el comando.

source: There are a few platform-specific directories which contain C code.
es_es: Hay algunos directorios específicos de la plataforma que contienen código C.

source: The special literals __FILE__, __LINE__, and __PACKAGE__ represent the current filename, line number, and package name at that point in your program.
es_es: Los literales especiales __FILE__, __LINE__ y __PACKAGE__ representan el nombre del archivo actual, número de línea, y el nombre del paquete en ese punto de su programa.

source: =head2 Implicit strictures
es_es: =head2 Restricciones implícitas

source: =head3 Barewords X<bareword>
es_es: =head3 Palabras sueltas X<bareword>

source: This modifier means to use the "Default" native rules of the platform except when there is cause to use Unicode rules instead, as follows:
es_es: Este modificador significa usar las reglas nativas "Predeterminadas" (I<Default>) de la plataforma, excepto cuando hay razones para utilizar las reglas Unicode, de la siguiente manera:

source: printf '<%.*s>', -1, "string"; # prints "<string>"
es_es: printf '<%.*s>', -1, "cadena"; # imprime "<cadena>"

source: If the system call fails, C<syscall> returns C<-1> and sets C<$!> (errno).
es_es: Si la llamada al sistema falla, C<syscall> devuelve C<-1> y establece C<$!> (errno).

source: If EXPR is not specified, C<$_> will be used.
es_es: Si EXPR no se especifica, se comprobará C<$_>.

source: ... and run the script as C</path/to/script.pl>.
es_es: ... y ejecutar el script como C</ruta/script.pl>.

source: Anywhere else it's $<I<digit>>.
es_es: En cualquier otro lugar, es $<I<dígito>>.

source: $Price = '$100'; # not interpolated
es_es: $Precio = '$100'; # no interpolado

source: TELL this
es_es: TELL este

source: If the LENGTH is greater than the data available in the SCALAR after the OFFSET, only as much data as is available will be written.
es_es: Si LONGITUD es mayor que los datos disponibles en ESCALAR después del DESPLAZAMIENTO, sólo se escribirán los datos que estén disponibles.

source: These look like
es_es: Aparecen así

source: This is useful when the structure you're unpacking has encoded the sizes or repeat counts for some of its fields within the structure itself as separate fields.
es_es: Esto es útil cuando la estructura que está desempaquetando tiene codificados los tamaños o recuentos de repetición para algunos de sus campos dentro de la propia estructura como campos separados.

source: To run a Perl program from the Unix command line:
es_es: Para ejecutar un programa Perl desde la línea de comandos de Unix, use el siguiente comando:

source: 5.8 has a sort pragma for limited control of the sort.
es_es: v5,8 tiene un pragma para sort, para un control limitado de la ordenación.

source: =item setservent STAYOPEN
es_es: =item setservent SIGUEABIERTO

source: For C<next>, just double the braces: X<next> X<last> X<redo>
es_es: Para C<next>, solamente doble las llaves: X<next> X<last> X<redo>

source: # the -g operator is often equivalent.
es_es: # el operador -g es, a menudo, equivalente.

source: "\N{LATIN SMALL LIGATURE FI}" =~ /fi/i; # Matches
es_es: "\N{LATIN SMALL LIGATURE FI}" =~ /fi/i; # Coincide

source: print $bar; # still prints 30
es_es: print $bar; # sigue pintando 30

source: Equivalent to C<print FILEHANDLE sprintf(FORMAT, LIST)>, except that C<$\> (the output record separator) is not appended.
es_es: Equivalente a C<print IDENTIFICADOR_ARCHIVO sprintf(FORMATO, LISTA)>, excepto que C<$\> (el separador de registro a la salida) no es añadida.

source: Note that just because a hash is initialized in that order doesn't mean that it comes out in that order.
es_es: Tenga en cuenta que sólo porque un hash se inicializa en ese orden no quiere decir que salga en ese orden.

source: L<http://juerd.nl/site.plp/perlcheat> - home of the Perl Cheat Sheet
es_es: L<http://juerd.nl/site.plp/perlcheat> - Página de la hoja resumen de Perl

source: Each version of Perl comes with the documentation that was current at the time of release.
es_es: Cada versión de Perl incluye documentación actualizada en el momento del lanzamiento.

source: perlriscos Perl notes for RISC OS
es_es: perlriscos Notas para RISC OS

source: The returned value is a normalized version of the original pattern.
es_es: El valor devuelto es una versión normalizada del patrón original.

source: The complete regular expression matches this time, and you get the expected output of "table follows foo."
es_es: La expresión regular completa coincide en este momento, y consigue el resultado esperado de "espinacas sigue a come".

source: The following standard quantifiers are recognized: X<metacharacter> X<quantifier> X<*> X<+> X<?> X<{n}> X<{n,}> X<{n,m}>
es_es: Se reconocen los siguientes cuantificadores estándares: X<metacharacter> X<quantifier> X<*> X<+> X<?> X<{n}> X<{n,}> X<{n,m}> X<metacarácter> X<cuantificador>

source: perlunitut - Perl Unicode Tutorial
es_es: perlunitut - Tutorial de Unicode en Perl

source: =head2 New probes
es_es: =head2 Nuevas pruebas

source: The quoted part ends on the first C<"> and C</>, and the rest happens to be a syntax error.
es_es: La parte entrecomillada termina en la primera C<"> y C</>, y el resto pasa a ser un error de sintaxis.

source: means that no fee is charged for the item itself, though there may be fees involved in handling the item.
es_es: significa que no se cobra cuota por el propio elemento, aunque puede haber cargos involucrados en el manejo del elemento.

source: perldebguts Perl debugging guts and tips
es_es: perldebguts Componentes y consejos para la depuración

source: Although the most common reason to learn this is to unravel labyrinthine regular expressions, because the initial steps of parsing are the same for all quoting operators, they are all discussed together.
es_es: Aunque la razón más común para aprender esto es desentrañar laberínticas expresiones regulares, ya que los pasos iniciales del análisis son los mismos para todos los operadores de entrecomillado, todos ellos son explicados en conjunto.

source: You might find these links useful:
es_es: Es posible que estos vínculos le resulten de utilidad:

source: =item our EXPR : ATTRS
es_es: =item our EXPR : ATRIBUTOS

source: Well, usually.
es_es: Bueno, normalmente.

source: C<$^N> can be used in extended patterns (see below), for example to assign a submatch to a variable.
es_es: C<$^N> puede ser usado en patrones extendidos (ver abajo), por ejemplo para asignar una sub coincidencia a una variable.

source: Stable CPAN modules
es_es: Módulos estables de CPAN

source: foreword by Damian Conway
es_es: prólogo de Damian Conway

source: %n special: *stores* the number of characters output so far
es_es: %n especial: *almacena* el número de caracteres mostrados hasta ahora

source: C<@>, C<x>, and C<X>, where it is equivalent to C<0>.
es_es: C<@>, C<x> y C<X>, donde es equivalente a C<0>.

source: $a = $b || $c; # better written this way
es_es: $a = $b || $c; # mejor escrito de esta manera

source: And some of those digits look like some of the 10 ASCII digits, but mean a different number, so a human could easily think a number is a different quantity than it really is.
es_es: Y algunas de esas cifras se parecen a algunos de los 10 dígitos ASCII, pero significan un número diferente, por lo que un ser humano podría pensar en un número con una cantidad diferente de lo que realmente es.

source: while (my $paragraph = <>) {
es_es: while (my $parrafo = <>) {

source: In Perl, a sequence of statements that defines a scope is called a block.
es_es: En Perl, una secuencia de instrucciones que define un ámbito se llama un bloque.

source: ITER: { foreach $prefix (@INC) { $realfilename = "$prefix/$filename"; if (-f $realfilename) { $INC{$filename} = $realfilename; $result = do $realfilename; last ITER; } } die "Can't find $filename in \@INC";
es_es: ITER: { foreach $prefix (@INC) { $nombre_archivo_real = "$prefijo/$archivo"; if (-f $nombre_archivo_real) { $INC{$archivo} = $nombre_archivo_real; $resultado = do $nombre_archivo_real; last ITER; } } die "No encuentro el $archivo en \@INC";

source: Unary "-" performs arithmetic negation if the operand is numeric, including any string that looks like a number.
es_es: Unario "-" lleva a cabo la negación aritmética si el operando es numérico, incluyendo cualquier string que se parezca a un número.

source: Examples of specialized languages that come to mind include prolog and matlab.
es_es: Algunos ejemplos de lenguajes especializados son prolog y matlab.

source: perlclib Internal replacements for standard C library functions
es_es: perlclib Sustitutos internos de la biblioteca de C estándar

source: Here are some examples that you should be able to type into your command shell:
es_es: Aquí hay algunos ejemplos que será capaz de escribir en la línea de comandos del shell:

source: Contrary to its appearance, C<#[ \t]*> I<is not> the correct subexpression to match the comment delimiter, because it may "give up" some whitespace if the remainder of the pattern can be made to match that way.
es_es: Contrariamente a lo que parece, C<#[ \t]*> I<no es> la subexpresión correcta para coincidir con el delimitador del comentario, porque puede "dejar aparte" algún espacio en blanco si el resto del patrón lo hace coincidir con él.

source: my %rules = ( '\\' => '\\\\', 'Y|' => qr/(?=\S)(?<!\S)|(?!\S)(?<=\S)/ );
es_es: my %reglas = ( '\\' => '\\\\', 'Y|' => qr/(?=\S)(?<!\S)|(?!\S)(?<=\S)/ );

source: For examples of MRO implementations, see C<S_mro_get_linear_isa_c3()> and the C<BOOT:> section of F<mro/mro.xs>, and C<S_mro_get_linear_isa_dfs()> in F<mro.c>
es_es: Para ver ejemplos de las implementaciones de MRO, vea C<S_mro_get_linear_isa_c3()> y la sección C<BOOT:> de F<mro/mro.xs>, y C<S_mro_get_linear_isa_dfs()> en F<mro.c>

source: For the sake of portability it is a good idea always to use it when appropriate, and never to use it when it isn't appropriate.
es_es: Para una mejor portabilidad es siempre una buena idea usarlo cuando sea apropiado, y nunca usarlo cuando no sea apropiado.

source: There is no need to pre-declare your variable types, but you have to declare them using the C<my> keyword the first time you use them.
es_es: No es necesario predeclarar los tipos de las variables, pero éstas deben declararse con la palabra clave C<my> la primera vez que se usan.

source: if (blessed($ev_err) && $ev_err->isa("Some::Module::Exception")) { # handle Some::Module::Exception
es_es: if (blessed($ev_err) && $ev_err->isa("Some::Module::Exception")) { # controlador Some::Module::Exception

source: See also L</exec>.
es_es: Ver también L</exec>.

source: This is not particularly efficient.
es_es: Esto no es particularmente eficiente.

source: Mnemonic for C<(?^...)>: A fresh beginning since the usual use of a caret is to match at the beginning.
es_es: Mnemotécnico para C<(?^...)>: Un nuevo comienzo, ya que el uso normal de un circunflejo es coincidir con el comienzo del patrón.

source: Documentation typos fixed
es_es: Arreglados errores ortográficos en la documentación

source: perlhpux Perl notes for HP-UX
es_es: perlhpux Notas para HP-UX

source: Don't go through silly contortions to exit a loop at the top or the bottom, when Perl provides the C<last> operator so you can exit in the middle.
es_es: No haga tontas contorsiones para salir de un bucle al inicio o al final, cuando Perl dispone del operador C<last> para que pueda salir desde el interior.

source: $a = s/abc/def/r; # $a is 'def123xyz' and # $_ remains 'abc123xyz'.
es_es: $a = s/abc/def/r; # $a es 'def123xyz' y $_ queda como 'abc123xyz'

source: L<http://perlmonks.org/?node_id=216602> - the original PM post
es_es: L<http://perlmonks.org/?node_id=216602> - Artículo original de PM

source: (This may seem like an odd thing to you, but you'll use the construct in almost every Perl script you write.) The $_ variable is not implicitly localized.
es_es: (Esto puede parecer algo extraño para usted, pero usará esta construcción en casi todos los scripts de Perl que escriba). La variable $_ no estará, implícitamente, localizada en el contexto del bucle.

source: This includes operands that might otherwise be interpreted as operators, constants, single number v-strings or function calls.
es_es: Esto incluye operandos que, de lo contrario, podrían interpretarse como operadores, constantes, un solo número o v-cadenas o llamadas a funciones.

source: Described in L<perlre>, with additional examples in L<perlop>.
es_es: Se describe en L<perlre>, con ejemplos adicionales en L<perlop>.

source: READ this, scalar, length, offset
es_es: READ este, escalar, longitud, desplazamiento

source: As well as these filters for converting other languages, the L<pl2pm|pl2pm> utility will help you convert old-style Perl 4 libraries to new-style Perl5 modules.
es_es: Además de estos filtros para traducir otros lenguajes, la utilidad L<pl2pm|pl2pm> permite convertir bibliotecas de código Perl 4 antiguo en módulos de Perl 5 modernos.

source: Perl builds and runs on a bewildering number of platforms.
es_es: Perl se puede compilar y ejecutar en una gran variedad de plataformas.

source: Stick with that, and you should be safe.
es_es: Siga con eso, y estará seguro.

source: This is another way to protect your filenames from interpretation.
es_es: Esta es otra manera de proteger los nombres de archivo de su interpretación.

source: You can now use the C<x> operator to repeat a C<qw//> list.
es_es: Ahora puede usar el operador C<x> para repetir una lista C<qw//>.

source: White space can separate pack codes from each other, but modifiers and repeat counts must follow immediately.
es_es: El espacio en blanco puede separar los códigos de empaquetado, pero los modificadores y los contadores de repetición deben seguir de inmediato.

source: If the pattern was used as follows
es_es: Si el patrón se utilizó de esta manera

source: # print out history file offsets
es_es: # imprime los desplazamientos en el archivo histórico

source: In particular, as C<@_> contains aliases to the caller's arguments, Perl does not take a copy of C<@_>, so C<@DB::args> will contain modifications the subroutine makes to C<@_> or its contents, not the original values at call time.
es_es: En particular, como C<@_> contiene los alias de los argumentos de la función llamante, Perl no tiene una copia de C<@_>, así que C<@DB::args> contendrá modificaciones que la subrutina hace a C<@_> o de sus contenidos, no los valores originales a la hora de ser llamada.

source: Give examples of use in your documentation
es_es: Dé ejemplos de uso en la documentación

source: Every piece of advice given here is the result of previous mistakes.
es_es: Cada consejo que aquí se da es el resultado de errores anteriores.

source: forces arguments to integer format.
es_es: Fuerzan la conversión de los argumentos al formato de entero.

source: || die "can't access /dev/tty: $!";
es_es: || die "no puedo acceder a /dev/tty: $!";

source: if (exists $ref->{A}->{B}->{$key}) { }
es_es: if (exists $ref->{A}->{B}->{$clave}) { }

source: Larry has his reasons for each of these things, but he doesn't claim that everyone else's mind works the same as his does.
es_es: Larry tiene sus razones para cada una de estas ideas, pero el no aspira que la mente de los demás trabaje de la misma forma que la suya.

source: For alignment commands, a C<count> of 0 is equivalent to a C<count> of 1; both are no-ops.
es_es: Para los comandos de alineación, un C<contador> de 0 es equivalente a un C<contador> de 1; ambos son instrucciones no efectivas.

source: To recursively create a directory structure, look at the C<mkpath> function of the L<File::Path> module.
es_es: Para, recursivamente, crear una estructura de directorios, mire la función C<mkpath> del módulo L<File::Path>.

source: N An unsigned long (32-bit) in "network" (big-endian) order.
es_es: N Un largo sin signo (32 bit) en orden "red" (big-endian).

source: Note that this code works in the same way on big-endian or little-endian machines.
es_es: Tenga en cuenta que este código funciona de la misma manera en máquinas big-endian que little-endian.

source: by Johan Vromans
es_es: Johan Vromans

source: given ($fruit) {
es_es: given ($fruta) {

source: perl5113delta Perl changes in version 5.11.3
es_es: perl5113delta Cambios en la versión 5.11.3

source: Joins the separate strings of LIST into a single string with fields separated by the value of EXPR, and returns that new string.
es_es: Une las cadenas separados de LISTA en una única cadena con campos separados por el valor de EXPR y devuelve la nueva cadena.

source: When choosing a new salt create a random two character string whose characters come from the set C<[./0-9A-Za-z]> (like C<join '', ('.', '/', 0..9, 'A'..'Z', 'a'..'z')[rand 64, rand 64]>).
es_es: Cuando escoja un nuevo salto cree un string de dos caracteres elegidos aleatoriamente del conjunto C<[./0-9A-Za-z]> (como por ejemplo C<join '', ('.', '/', 0..9, 'A'..'Z', 'a'..'z')[rand 64, rand 64]>).

source: This happens because
es_es: Esto sucede porque

source: See L<perldiag> for explanations of all Perl's diagnostics.
es_es: Encontrará en L<perldiag> las descripciones de todos los diagnósticos de Perl.

source: Similarly, all the characters that are decimal digits somewhere in the world will match C<\d>; this is hundreds, not 10, possible matches.
es_es: Del mismo modo, todos los caracteres que son dígitos decimales en algún lugar del mundo coincidirán con C<\d>,lo que significa que son cientos, no 10, de posibles coincidencias.

source: Thus C<< $ref->{"A"} >> and C<< $ref->{"A"}->{"B"} >> will spring into existence due to the existence test for the $key element above.
es_es: Así. C<< $ref->{"A"} >> y C<< $ref->{"A"}->{"B"} >> aparecerán en la existencia debido al actual test por el elemento $clave.

source: Implements the ioctl(2) function.
es_es: Implementa la función ioctl(2).

# print "failed to execute: $! ";
source: print "failed to execute: $!\n";
es_es: print "error al ejecutar: $!\n";

source: (To do runtime compilation only once, use C</$variable/o>.)
es_es: (Para hacer la compilación en tiempo de ejecución sólo una vez, utilice C</$variable/o>.)

source: perlmod Perl modules: how they work
es_es: perlmod Funcionamiento de un módulo Perl

source: F<pod2usage> is a special case of F<podselect>, a utility to extract named sections from documents written in POD.
es_es: F<pod2usage> es un caso especial de F<podselect>, una utilidad que permite extraer secciones con nombre de documentos escritos en formato POD.

source: perl572delta Perl changes in version 5.7.2
es_es: perl572delta Cambios en la versión 5.7.2

source: open(FOO, "<", $file)
es_es: open(FOO, "<", $archivo)

source: # timed out
es_es: # fin de temporización

source: 2 - that is, each element smart-matches the element of same index in the
es_es: 2 - es decir, cada elemento coincide inteligentemente con cada elemento del mismo índice.

source: When the arguments get executed via the system shell, results are subject to its quirks and capabilities.
es_es: Cuando los argumentos son ejecutados vía el shell del sistema, los resultados están sujetos a sus peculiaridades y capacidades.

source: t intepret integer as C type "ptrdiff_t" on Perl 5.14 or later
es_es: t interpreta un entero como "ptrdiff_t" del C en Perl 5.14 o superior

source: Let it be stressed that I<whatever falls between C<\Q> and C<\E>> is interpolated in the usual way.
es_es: Hay que hacer hincapié en que I<lo que caiga dentro de C<\Q> y C<\E>> es interpolado de la forma normal.

source: Note that capture groups matched inside of recursion are not accessible after the recursion returns, so the extra layer of capturing groups is necessary.
es_es: Tenga en cuenta que los grupos de captura encontrados en el interior de la recursión no son accesibles después del regreso de la recursión, por lo que es necesaria una capa extra de grupos de captura.

source: =head2 The C<overloading> pragma
es_es: =head2 El pragma C<overloading>

source: /(?'char'.)\g1/ # ... mix and match and print "'$1' is the first doubled character\n";
es_es: /(?'char'.)\g1/ # ... mezcla y busca and print "'$1' es el primer carácter repetido\n";

source: Either of these circumstances triggered tainting code that contained a pointer bug.
es_es: Cualquiera de estas circunstancias provocaba código contaminado que contenía un error de puntero.
